Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 32, 32, 64)        1792      
_________________________________________________________________
activation_1 (Activation)    (None, 32, 32, 64)        0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 32, 32, 64)        256       
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 64)        36928     
_________________________________________________________________
activation_2 (Activation)    (None, 32, 32, 64)        0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 32, 32, 64)        256       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 16, 128)       73856     
_________________________________________________________________
activation_3 (Activation)    (None, 16, 16, 128)       0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 16, 16, 128)       512       
_________________________________________________________________
dropout_2 (Dropout)          (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_4 (Activation)    (None, 16, 16, 128)       0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 16, 16, 128)       512       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 8, 8, 256)         295168    
_________________________________________________________________
activation_5 (Activation)    (None, 8, 8, 256)         0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 8, 8, 256)         1024      
_________________________________________________________________
dropout_3 (Dropout)          (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 8, 8, 256)         590080    
_________________________________________________________________
activation_6 (Activation)    (None, 8, 8, 256)         0         
_________________________________________________________________
batch_normalization_6 (Batch (None, 8, 8, 256)         1024      
_________________________________________________________________
dropout_4 (Dropout)          (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 8, 8, 256)         590080    
_________________________________________________________________
activation_7 (Activation)    (None, 8, 8, 256)         0         
_________________________________________________________________
batch_normalization_7 (Batch (None, 8, 8, 256)         1024      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 4, 4, 256)         0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 4, 4, 512)         1180160   
_________________________________________________________________
activation_8 (Activation)    (None, 4, 4, 512)         0         
_________________________________________________________________
batch_normalization_8 (Batch (None, 4, 4, 512)         2048      
_________________________________________________________________
dropout_5 (Dropout)          (None, 4, 4, 512)         0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 4, 4, 512)         2359808   
_________________________________________________________________
activation_9 (Activation)    (None, 4, 4, 512)         0         
_________________________________________________________________
batch_normalization_9 (Batch (None, 4, 4, 512)         2048      
_________________________________________________________________
dropout_6 (Dropout)          (None, 4, 4, 512)         0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 4, 4, 512)         2359808   
_________________________________________________________________
activation_10 (Activation)   (None, 4, 4, 512)         0         
_________________________________________________________________
batch_normalization_10 (Batc (None, 4, 4, 512)         2048      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 2, 2, 512)         0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 2, 2, 512)         2359808   
_________________________________________________________________
activation_11 (Activation)   (None, 2, 2, 512)         0         
_________________________________________________________________
batch_normalization_11 (Batc (None, 2, 2, 512)         2048      
_________________________________________________________________
dropout_7 (Dropout)          (None, 2, 2, 512)         0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 2, 2, 512)         2359808   
_________________________________________________________________
activation_12 (Activation)   (None, 2, 2, 512)         0         
_________________________________________________________________
batch_normalization_12 (Batc (None, 2, 2, 512)         2048      
_________________________________________________________________
dropout_8 (Dropout)          (None, 2, 2, 512)         0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 2, 2, 512)         2359808   
_________________________________________________________________
activation_13 (Activation)   (None, 2, 2, 512)         0         
_________________________________________________________________
batch_normalization_13 (Batc (None, 2, 2, 512)         2048      
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 1, 1, 512)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656    
_________________________________________________________________
activation_14 (Activation)   (None, 512)               0         
_________________________________________________________________
batch_normalization_14 (Batc (None, 512)               2048      
_________________________________________________________________
dropout_9 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 10)                5130      
_________________________________________________________________
activation_15 (Activation)   (None, 10)                0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 10)                0         
=================================================================
Total params: 15,001,418
Trainable params: 14,991,946
Non-trainable params: 9,472
_________________________________________________________________
Epoch 1/250
500/500 [==============================] - 81s 162ms/step - loss: 32.8235 - accuracy: 0.1613 - val_loss: 20.9598 - val_accuracy: 0.1554
Epoch 2/250
500/500 [==============================] - 75s 149ms/step - loss: 14.1879 - accuracy: 0.2433 - val_loss: 9.7198 - val_accuracy: 0.1585
Epoch 3/250
500/500 [==============================] - 74s 149ms/step - loss: 6.9041 - accuracy: 0.2890 - val_loss: 5.1557 - val_accuracy: 0.2790
Epoch 4/250
500/500 [==============================] - 74s 148ms/step - loss: 3.7692 - accuracy: 0.3675 - val_loss: 3.5193 - val_accuracy: 0.2033
Epoch 5/250
500/500 [==============================] - 74s 148ms/step - loss: 2.3747 - accuracy: 0.4655 - val_loss: 2.1112 - val_accuracy: 0.4935
Epoch 6/250
500/500 [==============================] - 74s 147ms/step - loss: 1.8274 - accuracy: 0.5406 - val_loss: 1.6917 - val_accuracy: 0.5650
Epoch 7/250
500/500 [==============================] - 74s 148ms/step - loss: 1.6023 - accuracy: 0.6001 - val_loss: 1.6798 - val_accuracy: 0.5881
Epoch 8/250
500/500 [==============================] - 74s 147ms/step - loss: 1.5044 - accuracy: 0.6394 - val_loss: 1.5237 - val_accuracy: 0.6570
Epoch 9/250
500/500 [==============================] - 74s 147ms/step - loss: 1.4970 - accuracy: 0.6602 - val_loss: 1.6826 - val_accuracy: 0.6464
Epoch 10/250
500/500 [==============================] - 74s 147ms/step - loss: 1.5170 - accuracy: 0.6743 - val_loss: 1.4317 - val_accuracy: 0.7097
Epoch 11/250
500/500 [==============================] - 74s 147ms/step - loss: 1.4162 - accuracy: 0.7030 - val_loss: 1.4279 - val_accuracy: 0.6991
Epoch 12/250
500/500 [==============================] - 74s 147ms/step - loss: 1.3937 - accuracy: 0.7108 - val_loss: 1.2937 - val_accuracy: 0.7468
Epoch 13/250
500/500 [==============================] - 74s 147ms/step - loss: 1.3886 - accuracy: 0.7192 - val_loss: 1.4817 - val_accuracy: 0.7010
Epoch 14/250
500/500 [==============================] - 74s 147ms/step - loss: 1.3909 - accuracy: 0.7246 - val_loss: 1.4001 - val_accuracy: 0.7281
Epoch 15/250
500/500 [==============================] - 74s 148ms/step - loss: 1.4040 - accuracy: 0.7278 - val_loss: 1.3607 - val_accuracy: 0.7449
Epoch 16/250
500/500 [==============================] - 74s 147ms/step - loss: 1.4034 - accuracy: 0.7322 - val_loss: 1.5390 - val_accuracy: 0.6910
Epoch 17/250
500/500 [==============================] - 74s 147ms/step - loss: 1.4040 - accuracy: 0.7344 - val_loss: 1.4140 - val_accuracy: 0.7379
Epoch 18/250
500/500 [==============================] - 74s 147ms/step - loss: 1.4136 - accuracy: 0.7380 - val_loss: 1.3509 - val_accuracy: 0.7597
Epoch 19/250
500/500 [==============================] - 74s 147ms/step - loss: 1.4196 - accuracy: 0.7391 - val_loss: 1.4216 - val_accuracy: 0.7412
Epoch 20/250
500/500 [==============================] - 74s 148ms/step - loss: 1.4266 - accuracy: 0.7421 - val_loss: 1.3649 - val_accuracy: 0.7651
Epoch 21/250
500/500 [==============================] - 74s 148ms/step - loss: 1.3463 - accuracy: 0.7588 - val_loss: 1.2624 - val_accuracy: 0.7783
Epoch 22/250
500/500 [==============================] - 74s 147ms/step - loss: 1.3202 - accuracy: 0.7618 - val_loss: 1.4733 - val_accuracy: 0.7248
Epoch 23/250
500/500 [==============================] - 74s 148ms/step - loss: 1.3205 - accuracy: 0.7622 - val_loss: 1.2004 - val_accuracy: 0.8014
Epoch 24/250
500/500 [==============================] - 76s 151ms/step - loss: 1.3320 - accuracy: 0.7639 - val_loss: 1.3825 - val_accuracy: 0.7508
Epoch 25/250
500/500 [==============================] - 74s 147ms/step - loss: 1.3242 - accuracy: 0.7671 - val_loss: 1.2613 - val_accuracy: 0.7856
Epoch 26/250
500/500 [==============================] - 74s 147ms/step - loss: 1.3258 - accuracy: 0.7691 - val_loss: 1.2605 - val_accuracy: 0.7935
Epoch 27/250
500/500 [==============================] - 74s 147ms/step - loss: 1.3342 - accuracy: 0.7696 - val_loss: 1.3009 - val_accuracy: 0.7801
Epoch 28/250
500/500 [==============================] - 74s 147ms/step - loss: 1.3260 - accuracy: 0.7722 - val_loss: 1.3936 - val_accuracy: 0.7559
Epoch 29/250
500/500 [==============================] - 74s 147ms/step - loss: 1.3371 - accuracy: 0.7711 - val_loss: 1.3323 - val_accuracy: 0.7731
Epoch 30/250
500/500 [==============================] - 74s 147ms/step - loss: 1.3325 - accuracy: 0.7744 - val_loss: 1.3662 - val_accuracy: 0.7632
Epoch 31/250
500/500 [==============================] - 74s 147ms/step - loss: 1.2700 - accuracy: 0.7891 - val_loss: 1.1270 - val_accuracy: 0.8313
Epoch 32/250
500/500 [==============================] - 74s 147ms/step - loss: 1.2384 - accuracy: 0.7912 - val_loss: 1.2681 - val_accuracy: 0.7755
Epoch 33/250
500/500 [==============================] - 74s 147ms/step - loss: 1.2345 - accuracy: 0.7922 - val_loss: 1.1212 - val_accuracy: 0.8286
Epoch 34/250
500/500 [==============================] - 74s 148ms/step - loss: 1.2390 - accuracy: 0.7907 - val_loss: 1.2211 - val_accuracy: 0.8013
Epoch 35/250
500/500 [==============================] - 74s 148ms/step - loss: 1.2375 - accuracy: 0.7931 - val_loss: 1.2147 - val_accuracy: 0.8030
Epoch 36/250
500/500 [==============================] - 74s 148ms/step - loss: 1.2512 - accuracy: 0.7914 - val_loss: 1.1845 - val_accuracy: 0.8139
Epoch 37/250
500/500 [==============================] - 74s 148ms/step - loss: 1.2476 - accuracy: 0.7949 - val_loss: 1.1317 - val_accuracy: 0.8315
Epoch 38/250
500/500 [==============================] - 74s 148ms/step - loss: 1.2532 - accuracy: 0.7923 - val_loss: 1.1807 - val_accuracy: 0.8193
Epoch 39/250
500/500 [==============================] - 74s 148ms/step - loss: 1.2565 - accuracy: 0.7945 - val_loss: 1.3046 - val_accuracy: 0.7848
Epoch 40/250
500/500 [==============================] - 74s 148ms/step - loss: 1.2420 - accuracy: 0.7949 - val_loss: 1.2341 - val_accuracy: 0.7988
Epoch 41/250
500/500 [==============================] - 74s 148ms/step - loss: 1.1782 - accuracy: 0.8102 - val_loss: 1.0689 - val_accuracy: 0.8464
Epoch 42/250
500/500 [==============================] - 74s 148ms/step - loss: 1.1568 - accuracy: 0.8126 - val_loss: 1.0535 - val_accuracy: 0.8471
Epoch 43/250
500/500 [==============================] - 74s 148ms/step - loss: 1.1528 - accuracy: 0.8130 - val_loss: 1.1152 - val_accuracy: 0.8232
Epoch 44/250
500/500 [==============================] - 74s 148ms/step - loss: 1.1542 - accuracy: 0.8120 - val_loss: 1.1988 - val_accuracy: 0.8066
Epoch 45/250
500/500 [==============================] - 74s 148ms/step - loss: 1.1633 - accuracy: 0.8115 - val_loss: 1.2114 - val_accuracy: 0.7938
Epoch 46/250
500/500 [==============================] - 74s 148ms/step - loss: 1.1537 - accuracy: 0.8138 - val_loss: 1.1397 - val_accuracy: 0.8173
Epoch 47/250
500/500 [==============================] - 74s 148ms/step - loss: 1.1562 - accuracy: 0.8128 - val_loss: 1.1643 - val_accuracy: 0.8078
Epoch 48/250
500/500 [==============================] - 74s 148ms/step - loss: 1.1620 - accuracy: 0.8120 - val_loss: 1.0999 - val_accuracy: 0.8314
Epoch 49/250
500/500 [==============================] - 74s 148ms/step - loss: 1.1527 - accuracy: 0.8147 - val_loss: 1.0958 - val_accuracy: 0.8353
Epoch 50/250
500/500 [==============================] - 74s 148ms/step - loss: 1.1669 - accuracy: 0.8138 - val_loss: 1.2937 - val_accuracy: 0.7763
Epoch 51/250
500/500 [==============================] - 74s 148ms/step - loss: 1.1064 - accuracy: 0.8295 - val_loss: 1.1608 - val_accuracy: 0.8208
Epoch 52/250
500/500 [==============================] - 74s 148ms/step - loss: 1.0812 - accuracy: 0.8317 - val_loss: 0.9852 - val_accuracy: 0.8554
Epoch 53/250
500/500 [==============================] - 74s 148ms/step - loss: 1.0764 - accuracy: 0.8282 - val_loss: 0.9668 - val_accuracy: 0.8627
Epoch 54/250
500/500 [==============================] - 74s 148ms/step - loss: 1.0674 - accuracy: 0.8303 - val_loss: 1.1121 - val_accuracy: 0.8204
Epoch 55/250
500/500 [==============================] - 74s 148ms/step - loss: 1.0676 - accuracy: 0.8304 - val_loss: 1.0306 - val_accuracy: 0.8470
Epoch 56/250
500/500 [==============================] - 74s 148ms/step - loss: 1.0744 - accuracy: 0.8302 - val_loss: 1.0338 - val_accuracy: 0.8409
Epoch 57/250
500/500 [==============================] - 74s 148ms/step - loss: 1.0691 - accuracy: 0.8331 - val_loss: 1.0221 - val_accuracy: 0.8465
Epoch 58/250
500/500 [==============================] - 74s 148ms/step - loss: 1.0749 - accuracy: 0.8286 - val_loss: 1.0259 - val_accuracy: 0.8452
Epoch 59/250
500/500 [==============================] - 74s 148ms/step - loss: 1.0752 - accuracy: 0.8309 - val_loss: 1.0893 - val_accuracy: 0.8307
Epoch 60/250
500/500 [==============================] - 74s 148ms/step - loss: 1.0854 - accuracy: 0.8319 - val_loss: 1.0307 - val_accuracy: 0.8478
Epoch 61/250
500/500 [==============================] - 74s 148ms/step - loss: 1.0262 - accuracy: 0.8441 - val_loss: 0.9973 - val_accuracy: 0.8502
Epoch 62/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9987 - accuracy: 0.8455 - val_loss: 1.0084 - val_accuracy: 0.8406
Epoch 63/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9947 - accuracy: 0.8431 - val_loss: 0.9136 - val_accuracy: 0.8725
Epoch 64/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9934 - accuracy: 0.8443 - val_loss: 0.8976 - val_accuracy: 0.8771
Epoch 65/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9860 - accuracy: 0.8472 - val_loss: 0.9587 - val_accuracy: 0.8590
Epoch 66/250
500/500 [==============================] - 74s 147ms/step - loss: 0.9829 - accuracy: 0.8477 - val_loss: 0.9556 - val_accuracy: 0.8588
Epoch 67/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9823 - accuracy: 0.8475 - val_loss: 0.9653 - val_accuracy: 0.8512
Epoch 68/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9884 - accuracy: 0.8465 - val_loss: 0.9167 - val_accuracy: 0.8673
Epoch 69/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9904 - accuracy: 0.8468 - val_loss: 0.9226 - val_accuracy: 0.8659
Epoch 70/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9963 - accuracy: 0.8449 - val_loss: 0.9426 - val_accuracy: 0.8634
Epoch 71/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9452 - accuracy: 0.8588 - val_loss: 0.9021 - val_accuracy: 0.8731
Epoch 72/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9194 - accuracy: 0.8625 - val_loss: 0.8794 - val_accuracy: 0.8733
Epoch 73/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9121 - accuracy: 0.8629 - val_loss: 0.8867 - val_accuracy: 0.8671
Epoch 74/250
500/500 [==============================] - 74s 147ms/step - loss: 0.9029 - accuracy: 0.8632 - val_loss: 0.8441 - val_accuracy: 0.8800
Epoch 75/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9096 - accuracy: 0.8592 - val_loss: 0.8677 - val_accuracy: 0.8708
Epoch 76/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9010 - accuracy: 0.8612 - val_loss: 0.8904 - val_accuracy: 0.8637
Epoch 77/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9086 - accuracy: 0.8608 - val_loss: 0.8894 - val_accuracy: 0.8667
Epoch 78/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9112 - accuracy: 0.8594 - val_loss: 0.8518 - val_accuracy: 0.8804
Epoch 79/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9083 - accuracy: 0.8605 - val_loss: 0.8502 - val_accuracy: 0.8808
Epoch 80/250
500/500 [==============================] - 74s 148ms/step - loss: 0.9089 - accuracy: 0.8622 - val_loss: 0.8577 - val_accuracy: 0.8786
Epoch 81/250
500/500 [==============================] - 74s 148ms/step - loss: 0.8679 - accuracy: 0.8718 - val_loss: 0.8286 - val_accuracy: 0.8867
Epoch 82/250
500/500 [==============================] - 74s 147ms/step - loss: 0.8503 - accuracy: 0.8740 - val_loss: 0.8422 - val_accuracy: 0.8761
Epoch 83/250
500/500 [==============================] - 74s 148ms/step - loss: 0.8440 - accuracy: 0.8731 - val_loss: 0.8096 - val_accuracy: 0.8879
Epoch 84/250
500/500 [==============================] - 74s 148ms/step - loss: 0.8331 - accuracy: 0.8770 - val_loss: 0.8016 - val_accuracy: 0.8852
Epoch 85/250
500/500 [==============================] - 74s 148ms/step - loss: 0.8398 - accuracy: 0.8745 - val_loss: 0.8100 - val_accuracy: 0.8831
Epoch 86/250
500/500 [==============================] - 74s 148ms/step - loss: 0.8331 - accuracy: 0.8746 - val_loss: 0.8294 - val_accuracy: 0.8816
Epoch 87/250
500/500 [==============================] - 74s 148ms/step - loss: 0.8323 - accuracy: 0.8739 - val_loss: 0.8050 - val_accuracy: 0.8818
Epoch 88/250
500/500 [==============================] - 74s 148ms/step - loss: 0.8433 - accuracy: 0.8711 - val_loss: 0.8742 - val_accuracy: 0.8647
Epoch 89/250
500/500 [==============================] - 74s 148ms/step - loss: 0.8356 - accuracy: 0.8747 - val_loss: 0.8154 - val_accuracy: 0.8830
Epoch 90/250
500/500 [==============================] - 74s 148ms/step - loss: 0.8372 - accuracy: 0.8739 - val_loss: 0.8966 - val_accuracy: 0.8593
Epoch 91/250
500/500 [==============================] - 74s 148ms/step - loss: 0.8018 - accuracy: 0.8829 - val_loss: 0.7872 - val_accuracy: 0.8882
Epoch 92/250
500/500 [==============================] - 74s 148ms/step - loss: 0.7830 - accuracy: 0.8874 - val_loss: 0.7441 - val_accuracy: 0.9006
Epoch 93/250
500/500 [==============================] - 74s 148ms/step - loss: 0.7784 - accuracy: 0.8865 - val_loss: 0.7966 - val_accuracy: 0.8812
Epoch 94/250
500/500 [==============================] - 74s 148ms/step - loss: 0.7743 - accuracy: 0.8851 - val_loss: 0.7861 - val_accuracy: 0.8837
Epoch 95/250
500/500 [==============================] - 74s 148ms/step - loss: 0.7655 - accuracy: 0.8886 - val_loss: 0.7710 - val_accuracy: 0.8886
Epoch 96/250
500/500 [==============================] - 74s 147ms/step - loss: 0.7628 - accuracy: 0.8887 - val_loss: 0.8039 - val_accuracy: 0.8762
Epoch 97/250
500/500 [==============================] - 74s 148ms/step - loss: 0.7627 - accuracy: 0.8890 - val_loss: 0.7799 - val_accuracy: 0.8845
Epoch 98/250
500/500 [==============================] - 74s 148ms/step - loss: 0.7631 - accuracy: 0.8867 - val_loss: 0.7525 - val_accuracy: 0.8914
Epoch 99/250
500/500 [==============================] - 74s 148ms/step - loss: 0.7673 - accuracy: 0.8852 - val_loss: 0.7761 - val_accuracy: 0.8862
Epoch 100/250
500/500 [==============================] - 74s 148ms/step - loss: 0.7690 - accuracy: 0.8862 - val_loss: 0.7832 - val_accuracy: 0.8827
Epoch 101/250
500/500 [==============================] - 74s 148ms/step - loss: 0.7346 - accuracy: 0.8954 - val_loss: 0.7157 - val_accuracy: 0.9017
Epoch 102/250
500/500 [==============================] - 74s 148ms/step - loss: 0.7167 - accuracy: 0.8983 - val_loss: 0.7086 - val_accuracy: 0.9038
Epoch 103/250
500/500 [==============================] - 74s 148ms/step - loss: 0.7116 - accuracy: 0.8988 - val_loss: 0.7402 - val_accuracy: 0.8902
Epoch 104/250
500/500 [==============================] - 74s 148ms/step - loss: 0.7092 - accuracy: 0.8981 - val_loss: 0.7073 - val_accuracy: 0.8992
Epoch 105/250
500/500 [==============================] - 74s 148ms/step - loss: 0.7035 - accuracy: 0.8996 - val_loss: 0.7047 - val_accuracy: 0.8990
Epoch 106/250
500/500 [==============================] - 74s 148ms/step - loss: 0.6962 - accuracy: 0.9013 - val_loss: 0.6930 - val_accuracy: 0.9020
Epoch 107/250
500/500 [==============================] - 74s 148ms/step - loss: 0.7040 - accuracy: 0.8981 - val_loss: 0.7007 - val_accuracy: 0.8978
Epoch 108/250
500/500 [==============================] - 74s 148ms/step - loss: 0.6975 - accuracy: 0.9011 - val_loss: 0.7388 - val_accuracy: 0.8886
Epoch 109/250
500/500 [==============================] - 74s 148ms/step - loss: 0.7036 - accuracy: 0.8977 - val_loss: 0.7175 - val_accuracy: 0.8943
Epoch 110/250
500/500 [==============================] - 74s 147ms/step - loss: 0.6937 - accuracy: 0.9004 - val_loss: 0.6949 - val_accuracy: 0.8988
Epoch 111/250
500/500 [==============================] - 74s 148ms/step - loss: 0.6700 - accuracy: 0.9078 - val_loss: 0.6933 - val_accuracy: 0.9008
Epoch 112/250
500/500 [==============================] - 74s 147ms/step - loss: 0.6617 - accuracy: 0.9088 - val_loss: 0.6832 - val_accuracy: 0.9018
Epoch 113/250
500/500 [==============================] - 74s 148ms/step - loss: 0.6562 - accuracy: 0.9082 - val_loss: 0.6589 - val_accuracy: 0.9106
Epoch 114/250
500/500 [==============================] - 74s 148ms/step - loss: 0.6475 - accuracy: 0.9101 - val_loss: 0.6925 - val_accuracy: 0.8966
Epoch 115/250
500/500 [==============================] - 74s 148ms/step - loss: 0.6480 - accuracy: 0.9077 - val_loss: 0.6747 - val_accuracy: 0.8995
Epoch 116/250
500/500 [==============================] - 74s 148ms/step - loss: 0.6414 - accuracy: 0.9100 - val_loss: 0.6583 - val_accuracy: 0.9051
Epoch 117/250
500/500 [==============================] - 74s 148ms/step - loss: 0.6416 - accuracy: 0.9097 - val_loss: 0.7076 - val_accuracy: 0.8880
Epoch 118/250
500/500 [==============================] - 74s 148ms/step - loss: 0.6433 - accuracy: 0.9083 - val_loss: 0.6590 - val_accuracy: 0.9052
Epoch 119/250
500/500 [==============================] - 74s 148ms/step - loss: 0.6403 - accuracy: 0.9094 - val_loss: 0.6656 - val_accuracy: 0.9023
Epoch 120/250
500/500 [==============================] - 74s 148ms/step - loss: 0.6386 - accuracy: 0.9111 - val_loss: 0.6743 - val_accuracy: 0.9008
Epoch 121/250
500/500 [==============================] - 74s 148ms/step - loss: 0.6172 - accuracy: 0.9155 - val_loss: 0.6625 - val_accuracy: 0.9030
Epoch 122/250
500/500 [==============================] - 74s 147ms/step - loss: 0.6018 - accuracy: 0.9188 - val_loss: 0.6570 - val_accuracy: 0.9065
Epoch 123/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5990 - accuracy: 0.9194 - val_loss: 0.6525 - val_accuracy: 0.9040
Epoch 124/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5917 - accuracy: 0.9201 - val_loss: 0.6734 - val_accuracy: 0.8982
Epoch 125/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5849 - accuracy: 0.9207 - val_loss: 0.6261 - val_accuracy: 0.9081
Epoch 126/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5819 - accuracy: 0.9219 - val_loss: 0.6614 - val_accuracy: 0.8994
Epoch 127/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5826 - accuracy: 0.9207 - val_loss: 0.6673 - val_accuracy: 0.8997
Epoch 128/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5823 - accuracy: 0.9194 - val_loss: 0.6080 - val_accuracy: 0.9151
Epoch 129/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5850 - accuracy: 0.9191 - val_loss: 0.6573 - val_accuracy: 0.9001
Epoch 130/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5809 - accuracy: 0.9208 - val_loss: 0.6457 - val_accuracy: 0.9031
Epoch 131/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5554 - accuracy: 0.9270 - val_loss: 0.6172 - val_accuracy: 0.9107
Epoch 132/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5497 - accuracy: 0.9294 - val_loss: 0.6417 - val_accuracy: 0.9024
Epoch 133/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5394 - accuracy: 0.9300 - val_loss: 0.6137 - val_accuracy: 0.9109
Epoch 134/250
500/500 [==============================] - 74s 147ms/step - loss: 0.5372 - accuracy: 0.9297 - val_loss: 0.6295 - val_accuracy: 0.9089
Epoch 135/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5367 - accuracy: 0.9293 - val_loss: 0.6282 - val_accuracy: 0.9091
Epoch 136/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5357 - accuracy: 0.9301 - val_loss: 0.5912 - val_accuracy: 0.9180
Epoch 137/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5390 - accuracy: 0.9283 - val_loss: 0.6009 - val_accuracy: 0.9092
Epoch 138/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5296 - accuracy: 0.9302 - val_loss: 0.6084 - val_accuracy: 0.9105
Epoch 139/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5314 - accuracy: 0.9288 - val_loss: 0.5961 - val_accuracy: 0.9126
Epoch 140/250
500/500 [==============================] - 74s 147ms/step - loss: 0.5291 - accuracy: 0.9303 - val_loss: 0.6052 - val_accuracy: 0.9099
Epoch 141/250
500/500 [==============================] - 74s 148ms/step - loss: 0.5094 - accuracy: 0.9362 - val_loss: 0.5868 - val_accuracy: 0.9129
Epoch 142/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4957 - accuracy: 0.9403 - val_loss: 0.5802 - val_accuracy: 0.9171
Epoch 143/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4933 - accuracy: 0.9394 - val_loss: 0.5823 - val_accuracy: 0.9154
Epoch 144/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4873 - accuracy: 0.9394 - val_loss: 0.5719 - val_accuracy: 0.9173
Epoch 145/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4855 - accuracy: 0.9387 - val_loss: 0.5731 - val_accuracy: 0.9147
Epoch 146/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4878 - accuracy: 0.9376 - val_loss: 0.5713 - val_accuracy: 0.9140
Epoch 147/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4839 - accuracy: 0.9391 - val_loss: 0.5818 - val_accuracy: 0.9128
Epoch 148/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4774 - accuracy: 0.9400 - val_loss: 0.5776 - val_accuracy: 0.9118
Epoch 149/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4814 - accuracy: 0.9366 - val_loss: 0.5756 - val_accuracy: 0.9148
Epoch 150/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4809 - accuracy: 0.9384 - val_loss: 0.6021 - val_accuracy: 0.9047
Epoch 151/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4628 - accuracy: 0.9428 - val_loss: 0.5419 - val_accuracy: 0.9222
Epoch 152/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4494 - accuracy: 0.9470 - val_loss: 0.5449 - val_accuracy: 0.9208
Epoch 153/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4531 - accuracy: 0.9446 - val_loss: 0.5682 - val_accuracy: 0.9163
Epoch 154/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4464 - accuracy: 0.9467 - val_loss: 0.5742 - val_accuracy: 0.9128
Epoch 155/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4474 - accuracy: 0.9460 - val_loss: 0.5536 - val_accuracy: 0.9173
Epoch 156/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4440 - accuracy: 0.9468 - val_loss: 0.5628 - val_accuracy: 0.9136
Epoch 157/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4376 - accuracy: 0.9473 - val_loss: 0.5607 - val_accuracy: 0.9153
Epoch 158/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4330 - accuracy: 0.9483 - val_loss: 0.5524 - val_accuracy: 0.9176
Epoch 159/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4381 - accuracy: 0.9466 - val_loss: 0.5545 - val_accuracy: 0.9149
Epoch 160/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4373 - accuracy: 0.9465 - val_loss: 0.5477 - val_accuracy: 0.9167
Epoch 161/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4153 - accuracy: 0.9523 - val_loss: 0.5177 - val_accuracy: 0.9247
Epoch 162/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4125 - accuracy: 0.9526 - val_loss: 0.5423 - val_accuracy: 0.9186
Epoch 163/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4092 - accuracy: 0.9537 - val_loss: 0.5341 - val_accuracy: 0.9199
Epoch 164/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4056 - accuracy: 0.9534 - val_loss: 0.5248 - val_accuracy: 0.9242
Epoch 165/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4062 - accuracy: 0.9532 - val_loss: 0.5487 - val_accuracy: 0.9143
Epoch 166/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4005 - accuracy: 0.9539 - val_loss: 0.5320 - val_accuracy: 0.9186
Epoch 167/250
500/500 [==============================] - 74s 148ms/step - loss: 0.4002 - accuracy: 0.9540 - val_loss: 0.5282 - val_accuracy: 0.9173
Epoch 168/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3935 - accuracy: 0.9556 - val_loss: 0.5247 - val_accuracy: 0.9224
Epoch 169/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3975 - accuracy: 0.9535 - val_loss: 0.5195 - val_accuracy: 0.9198
Epoch 170/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3933 - accuracy: 0.9548 - val_loss: 0.5361 - val_accuracy: 0.9189
Epoch 171/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3840 - accuracy: 0.9565 - val_loss: 0.5274 - val_accuracy: 0.9183
Epoch 172/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3761 - accuracy: 0.9594 - val_loss: 0.5084 - val_accuracy: 0.9229
Epoch 173/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3745 - accuracy: 0.9584 - val_loss: 0.4944 - val_accuracy: 0.9288
Epoch 174/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3719 - accuracy: 0.9595 - val_loss: 0.5072 - val_accuracy: 0.9269
Epoch 175/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3651 - accuracy: 0.9600 - val_loss: 0.5075 - val_accuracy: 0.9235
Epoch 176/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3652 - accuracy: 0.9599 - val_loss: 0.5413 - val_accuracy: 0.9155
Epoch 177/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3610 - accuracy: 0.9603 - val_loss: 0.5092 - val_accuracy: 0.9238
Epoch 178/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3583 - accuracy: 0.9615 - val_loss: 0.4924 - val_accuracy: 0.9257
Epoch 179/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3631 - accuracy: 0.9597 - val_loss: 0.5272 - val_accuracy: 0.9169
Epoch 180/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3614 - accuracy: 0.9599 - val_loss: 0.5103 - val_accuracy: 0.9221
Epoch 181/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3512 - accuracy: 0.9626 - val_loss: 0.4971 - val_accuracy: 0.9234
Epoch 182/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3437 - accuracy: 0.9649 - val_loss: 0.5047 - val_accuracy: 0.9261
Epoch 183/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3416 - accuracy: 0.9654 - val_loss: 0.4957 - val_accuracy: 0.9280
Epoch 184/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3409 - accuracy: 0.9651 - val_loss: 0.4929 - val_accuracy: 0.9273
Epoch 185/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3361 - accuracy: 0.9655 - val_loss: 0.5021 - val_accuracy: 0.9244
Epoch 186/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3325 - accuracy: 0.9664 - val_loss: 0.5022 - val_accuracy: 0.9253
Epoch 187/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3307 - accuracy: 0.9663 - val_loss: 0.4892 - val_accuracy: 0.9264
Epoch 188/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3311 - accuracy: 0.9654 - val_loss: 0.4902 - val_accuracy: 0.9236
Epoch 189/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3297 - accuracy: 0.9654 - val_loss: 0.4876 - val_accuracy: 0.9259
Epoch 190/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3251 - accuracy: 0.9673 - val_loss: 0.4875 - val_accuracy: 0.9260
Epoch 191/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3217 - accuracy: 0.9685 - val_loss: 0.4794 - val_accuracy: 0.9280
Epoch 192/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3147 - accuracy: 0.9693 - val_loss: 0.4756 - val_accuracy: 0.9288
Epoch 193/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3105 - accuracy: 0.9702 - val_loss: 0.4881 - val_accuracy: 0.9257
Epoch 194/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3083 - accuracy: 0.9717 - val_loss: 0.4790 - val_accuracy: 0.9288
Epoch 195/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3086 - accuracy: 0.9698 - val_loss: 0.4742 - val_accuracy: 0.9306
Epoch 196/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3050 - accuracy: 0.9710 - val_loss: 0.4806 - val_accuracy: 0.9259
Epoch 197/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3049 - accuracy: 0.9705 - val_loss: 0.4728 - val_accuracy: 0.9312
Epoch 198/250
500/500 [==============================] - 74s 148ms/step - loss: 0.3043 - accuracy: 0.9705 - val_loss: 0.4652 - val_accuracy: 0.9288
Epoch 199/250
500/500 [==============================] - 74s 147ms/step - loss: 0.3029 - accuracy: 0.9720 - val_loss: 0.4697 - val_accuracy: 0.9275
Epoch 200/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2977 - accuracy: 0.9711 - val_loss: 0.4813 - val_accuracy: 0.9260
Epoch 201/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2932 - accuracy: 0.9732 - val_loss: 0.4603 - val_accuracy: 0.9298
Epoch 202/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2903 - accuracy: 0.9734 - val_loss: 0.4579 - val_accuracy: 0.9338
Epoch 203/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2827 - accuracy: 0.9757 - val_loss: 0.4884 - val_accuracy: 0.9247
Epoch 204/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2854 - accuracy: 0.9744 - val_loss: 0.4551 - val_accuracy: 0.9325
Epoch 205/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2843 - accuracy: 0.9743 - val_loss: 0.4610 - val_accuracy: 0.9302
Epoch 206/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2822 - accuracy: 0.9746 - val_loss: 0.4767 - val_accuracy: 0.9246
Epoch 207/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2779 - accuracy: 0.9754 - val_loss: 0.4648 - val_accuracy: 0.9308
Epoch 208/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2762 - accuracy: 0.9759 - val_loss: 0.4735 - val_accuracy: 0.9287
Epoch 209/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2778 - accuracy: 0.9759 - val_loss: 0.4758 - val_accuracy: 0.9262
Epoch 210/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2750 - accuracy: 0.9758 - val_loss: 0.4635 - val_accuracy: 0.9316
Epoch 211/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2702 - accuracy: 0.9772 - val_loss: 0.4641 - val_accuracy: 0.9292
Epoch 212/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2679 - accuracy: 0.9769 - val_loss: 0.4484 - val_accuracy: 0.9318
Epoch 213/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2657 - accuracy: 0.9779 - val_loss: 0.4613 - val_accuracy: 0.9284
Epoch 214/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2627 - accuracy: 0.9791 - val_loss: 0.4637 - val_accuracy: 0.9294
Epoch 215/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2650 - accuracy: 0.9776 - val_loss: 0.4507 - val_accuracy: 0.9309
Epoch 216/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2612 - accuracy: 0.9789 - val_loss: 0.4511 - val_accuracy: 0.9313
Epoch 217/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2587 - accuracy: 0.9790 - val_loss: 0.4583 - val_accuracy: 0.9311
Epoch 218/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2548 - accuracy: 0.9794 - val_loss: 0.4693 - val_accuracy: 0.9287
Epoch 219/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2583 - accuracy: 0.9793 - val_loss: 0.4545 - val_accuracy: 0.9311
Epoch 220/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2546 - accuracy: 0.9789 - val_loss: 0.4613 - val_accuracy: 0.9278
Epoch 221/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2522 - accuracy: 0.9803 - val_loss: 0.4517 - val_accuracy: 0.9320
Epoch 222/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2509 - accuracy: 0.9798 - val_loss: 0.4535 - val_accuracy: 0.9306
Epoch 223/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2465 - accuracy: 0.9813 - val_loss: 0.4528 - val_accuracy: 0.9317
Epoch 224/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2466 - accuracy: 0.9813 - val_loss: 0.4404 - val_accuracy: 0.9348
Epoch 225/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2441 - accuracy: 0.9809 - val_loss: 0.4428 - val_accuracy: 0.9335
Epoch 226/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2426 - accuracy: 0.9820 - val_loss: 0.4521 - val_accuracy: 0.9321
Epoch 227/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2430 - accuracy: 0.9820 - val_loss: 0.4479 - val_accuracy: 0.9306
Epoch 228/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2401 - accuracy: 0.9822 - val_loss: 0.4448 - val_accuracy: 0.9331
Epoch 229/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2402 - accuracy: 0.9820 - val_loss: 0.4523 - val_accuracy: 0.9312
Epoch 230/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2403 - accuracy: 0.9815 - val_loss: 0.4404 - val_accuracy: 0.9342
Epoch 231/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2368 - accuracy: 0.9824 - val_loss: 0.4519 - val_accuracy: 0.9313
Epoch 232/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2338 - accuracy: 0.9833 - val_loss: 0.4399 - val_accuracy: 0.9341
Epoch 233/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2313 - accuracy: 0.9843 - val_loss: 0.4368 - val_accuracy: 0.9344
Epoch 234/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2310 - accuracy: 0.9834 - val_loss: 0.4389 - val_accuracy: 0.9346
Epoch 235/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2299 - accuracy: 0.9846 - val_loss: 0.4455 - val_accuracy: 0.9322
Epoch 236/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2267 - accuracy: 0.9855 - val_loss: 0.4449 - val_accuracy: 0.9337
Epoch 237/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2284 - accuracy: 0.9842 - val_loss: 0.4521 - val_accuracy: 0.9318
Epoch 238/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2295 - accuracy: 0.9835 - val_loss: 0.4376 - val_accuracy: 0.9335
Epoch 239/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2261 - accuracy: 0.9843 - val_loss: 0.4389 - val_accuracy: 0.9335
Epoch 240/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2254 - accuracy: 0.9847 - val_loss: 0.4417 - val_accuracy: 0.9340
Epoch 241/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2213 - accuracy: 0.9853 - val_loss: 0.4384 - val_accuracy: 0.9343
Epoch 242/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2233 - accuracy: 0.9849 - val_loss: 0.4461 - val_accuracy: 0.9326
Epoch 243/250
500/500 [==============================] - 74s 148ms/step - loss: 0.2193 - accuracy: 0.9857 - val_loss: 0.4426 - val_accuracy: 0.9340
Epoch 244/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2177 - accuracy: 0.9866 - val_loss: 0.4405 - val_accuracy: 0.9346
Epoch 245/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2217 - accuracy: 0.9849 - val_loss: 0.4423 - val_accuracy: 0.9335
Epoch 246/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2145 - accuracy: 0.9867 - val_loss: 0.4309 - val_accuracy: 0.9363
Epoch 247/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2165 - accuracy: 0.9861 - val_loss: 0.4325 - val_accuracy: 0.9338
Epoch 248/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2170 - accuracy: 0.9859 - val_loss: 0.4303 - val_accuracy: 0.9353
Epoch 249/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2140 - accuracy: 0.9864 - val_loss: 0.4280 - val_accuracy: 0.9359
Epoch 250/250
500/500 [==============================] - 74s 147ms/step - loss: 0.2142 - accuracy: 0.9861 - val_loss: 0.4367 - val_accuracy: 0.9344
313/313 [==============================] - 6s 20ms/step         Accuracy 1:  0.9344000220298767
10000/10000 [==============================] - 6s 589us/step    Accuracy 2:  0.9344000220298767
